{
    "Click here to add a new config file": "Haga clic aquí para agregar un nuevo archivo de configuración",
    "Click here to add a new host": "Haga clic aquí para agregar un nuevo host",
    "Click here to add a new translation": "Haga clic aquí para agregar una nueva traducción",
    "Example: host: Testhost (same as NAME on main page), Interface: wg0, config file: /etc/wireguard/wg0.conf": "Ejemplo: host: Testhost (igual que NOMBRE en la página principal), Interfaz: wg0, archivo de configuración: /etc/wireguard/wg0.conf\":",
    "Host address": "Dirección del servidor (IP)",
    "Host name": "nombre de host",
    "Important": "Importante",
    "Installation_hint_1": "Este adaptador admite WireGuard tanto en Linux como en Windows.",
    "Installation_hint_2": "El comando wg debe estar en PATH y el usuario necesita privilegios de administrador.",
    "Installation_hint_3": "Sugerencia: para obtener sugerencias de seguridad sobre el usuario que ejecuta y sudo, consulte el archivo Léame en github.",
    "Installation_hint_4": "Haga clic aquí para leer las sugerencias de seguridad en github.",
    "Installation_hint_5": "Marque la casilla de verificación de la ventana acoplable si está ejecutando WireGuard dentro de un contenedor de la ventana acoplable; ",
    "Installation_hint_6": "marque sudo si necesita sudo para ejecutar el comando sin contraseña.",
    "Interface name": "Nombre de la interfaz",
    "Main settings": "Ajustes principales",
    "Name": "Nombre",
    "Password": "Clave",
    "Please add all public key to name translations here. This will make it more convenient for you to identify the peers in the object tree.": "Agregue todas las claves públicas para las traducciones de nombres aquí. ",
    "Please add all your hosts running a WireGuard server instance which should be monitored.": "Agregue todos sus hosts que ejecutan una instancia de servidor WireGuard que debería ser",
    "Poll interval": "Intervalo de encuesta",
    "Public key": "Llave pública",
    "Public-Key translations": "Traducciones de clave pública",
    "Use sudo": "Usa sudo",
    "User": "Usuario",
    "You need to list all your WireGuard config files here (with full path) to use the peer reactivation feature. For more information please see the readme file on github.": "Debe enumerar todos sus archivos de configuración de WireGuard aquí (con la ruta completa) para usar la función de reactivación de pares. ",
    "config file": "archivo de configuración",
    "docker": "estibador",
    "donation": "Si te gusta este adaptador y consideras apoyarme:",
    "sudo": "sudo",
    "wgConfigFile": "archivo de configuración wg"
}