{
    "Check if you like to use sudo commands.": "Controleer of u sudo-commando's wilt gebruiken.",
    "Check if you use WireGuard in Docker containers.": "Controleer of u WireGuard gebruikt in Docker-containers.",
    "Click here to add a new config file": "Klik hier om een ​​nieuw configuratiebestand toe te voegen",
    "Click here to add a new host": "Klik hier om een ​​nieuwe host toe te voegen",
    "Click here to add a new translation": "Klik hier om een ​​nieuwe vertaling toe te voegen",
    "Config file": "Configuratiebestand",
    "Example: host: Testhost (same as NAME on main page), Interface: wg0, config file: /etc/wireguard/wg0.conf": "Voorbeeld: host: Testhost (zelfde als NAAM op hoofdpagina), Interface: wg0, configuratiebestand: /etc/wireguard/wg0.conf\":",
    "Fully qualified path of the config file for this interface. Often: /etc/wireguard/wg0.conf": "Volledig gekwalificeerd pad van het configuratiebestand voor deze interface. Vaak: /etc/wireguard/wg0.conf",
    "Host": "Gastheer",
    "Host address": "Host adres (IP)",
    "Host name": "Hostnaam",
    "Important": "Belangrijk",
    "Installation_hint_1": "Deze adapter ondersteunt WireGuard zowel op Linux als op Windows.",
    "Installation_hint_2": "wg-opdracht moet in PATH staan ​​en de gebruiker heeft beheerdersrechten nodig.",
    "Installation_hint_3": "Tip: Raadpleeg voor veiligheidstips met betrekking tot de uitvoerende gebruiker en sudo het ReadMe-bestand op github.",
    "Installation_hint_4": "Klik hier om veiligheidstips voor github te lezen.",
    "Installation_hint_5": "Schakel het selectievakje Docker in als u WireGuard in een docker-container gebruikt; ",
    "Installation_hint_6": "vink sudo aan als je sudo nodig hebt om de opdracht zonder wachtwoord uit te voeren.",
    "Interface name": "Interfacenaam",
    "Main config": "Hoofdconfiguratie",
    "Main settings": "Belangrijkste instellingen",
    "May be an IP, DNS-Hostname or FQDN.": "Kan een IP, DNS-hostnaam of FQDN zijn.",
    "Name": "Naam",
    "Name of your WireGuard Docker container.": "Naam van uw WireGuard Docker-container.",
    "Name of your WireGuard interface. e.g. wg0": "Naam van uw WireGuard-interface. bijv. wg0",
    "Name of your WireGuard monitoring user.": "Naam van uw WireGuard-monitoringgebruiker.",
    "Password": "Wachtwoord",
    "Please add all public key to name translations here. This will make it more convenient for you to identify the peers in the object tree.": "Voeg hier alle openbare sleutels toe aan naamvertalingen. ",
    "Please add all your hosts running a WireGuard server instance which should be monitored.": "Voeg a.u.b. al uw hosts toe die een WireGuard-serverexemplaar uitvoeren, wat zou moeten zijn:",
    "Poll interval": "Poll-interval",
    "Pollinterval - in Seconds.": "Pollinterval - in seconden.",
    "Public key": "Publieke sleutel",
    "Public key to username translations": "Publieke sleutel tot gebruikersnaamvertalingen",
    "Public-Key translations": "Public-Key vertalingen",
    "The Port your SSH server listens to.": "De poort waarnaar uw SSH-server luistert.",
    "Use sudo": "Gebruik sudo",
    "User": "Gebruiker",
    "WireGuard Config files": "WireGuard-configuratiebestanden",
    "WireGuard hosts": "WireGuard-hosts",
    "You need to list all your WireGuard config files here (with full path) to use the peer reactivation feature. For more information please see the readme file on github.": "U moet hier al uw WireGuard-configuratiebestanden vermelden (met volledig pad) om de peer-reactiveringsfunctie te gebruiken. ",
    "config file": "config-bestand",
    "docker": "havenarbeider",
    "donation": "Als je deze adapter leuk vindt en overweegt mij te steunen:",
    "sudo": "sudo",
    "wgConfigFile": "wg-configuratiebestand",
    "Name of the referenced host - must be the same as NAME on main config page!": "Naam van de host waarnaar wordt verwezen - moet hetzelfde zijn als NAME op de hoofdconfiguratiepagina!",
    "_Installation_hint_1": "Deze adapter ondersteunt WireGuard zowel op Linux als op Windows."
}
