{
    "Check if you like to use sudo commands.": "Перевірте, чи любите ви використовувати команди sudo.",
    "Check if you use WireGuard in Docker containers.": "Перевірте, чи використовуєте ви WireGuard у контейнерах Docker.",
    "Click here to add a new config file": "Натисніть тут, щоб додати новий конфігураційний файл",
    "Click here to add a new host": "Натисніть тут, щоб додати нового хоста",
    "Click here to add a new translation": "Натисніть тут, щоб додати новий переклад",
    "Config file": "Файл конфігурації",
    "Example: host: Testhost (same as NAME on main page), Interface: wg0, config file: /etc/wireguard/wg0.conf": "Приклад: хост: Testhost (те саме, що NAME на головній сторінці), інтерфейс: wg0, конфігураційний файл: /etc/wireguard/wg0.conf\":",
    "Fully qualified path of the config file for this interface. Often: /etc/wireguard/wg0.conf": "Повний шлях до конфігураційного файлу для цього інтерфейсу. Часто: /etc/wireguard/wg0.conf",
    "Host": "Хост",
    "Host address": "Адреса хоста (IP)",
    "Host name": "Ім'я хоста",
    "Important": "важливо",
    "Installation_hint_1": "Цей адаптер підтримує WireGuard як на Linux, так і на Windows.",
    "Installation_hint_2": "Команда wg має бути в PATH, а користувачеві потрібні права адміністратора.",
    "Installation_hint_3": "Порада. Щоб отримати підказки щодо безпеки щодо користувача, що виконується, і sudo, зверніться до файлу ReadMe на github.",
    "Installation_hint_4": "Натисніть тут, щоб прочитати поради щодо безпеки на github.",
    "Installation_hint_5": "Поставте прапорець у докері, якщо ви запускаєте WireGuard у контейнері докерів;",
    "Installation_hint_6": "активуйте sudo, якщо вам потрібно sudo для виконання команди без пароля.",
    "Interface name": "Назва інтерфейсу",
    "Main config": "Основна конфігурація",
    "Main settings": "Основні налаштування",
    "May be an IP, DNS-Hostname or FQDN.": "Це може бути IP-адреса, ім’я хоста DNS або FQDN.",
    "Name": "Ім'я",
    "Name of your WireGuard Docker container.": "Назва вашого контейнера WireGuard Docker.",
    "Name of your WireGuard interface. e.g. wg0": "Назва вашого інтерфейсу WireGuard. напр. wg0",
    "Name of your WireGuard monitoring user.": "Ім’я вашого користувача моніторингу WireGuard.",
    "Password": "Пароль",
    "Please add all public key to name translations here. This will make it more convenient for you to identify the peers in the object tree.": "Будь ласка, додайте сюди всі публічні ключі для перекладу імен. Це зробить для вас зручнішим визначення однорангових елементів у дереві об’єктів.",
    "Please add all your hosts running a WireGuard server instance which should be monitored.": "Будь ласка, додайте всі ваші хости, на яких працює примірник сервера WireGuard, який має бути",
    "Poll interval": "Інтервал опитування",
    "Pollinterval - in Seconds.": "Інтервал опитування - у секундах.",
    "Public key": "Відкритий ключ",
    "Public key to username translations": "Відкритий ключ для перекладу імені користувача",
    "Public-Key translations": "Переклади з відкритим ключем",
    "The Port your SSH server listens to.": "Порт, який прослуховує ваш сервер SSH.",
    "Use sudo": "sudo",
    "User": "Користувач",
    "WireGuard Config files": "Файли конфігурації WireGuard",
    "WireGuard hosts": "Хост WireGuard",
    "You need to list all your WireGuard config files here (with full path) to use the peer reactivation feature. For more information please see the readme file on github.": "Вам потрібно перелічити всі файли конфігурації WireGuard (з повним шляхом), щоб скористатися функцією повторної активації. Для отримання додаткової інформації перегляньте файл readme на github.",
    "config file": "Файл конфігурації",
    "docker": "докер",
    "donation": "Якщо вам подобається цей адаптер, подумайте про пожертву на підтримку моєї роботи.",
    "sudo": "sudo",
    "Name of the referenced host - must be the same as NAME on main config page!": "Ім'я хосту, на який посилається, має збігатися з ім'ям на головній сторінці конфігурації!"
}
