{
    "Check if you like to use sudo commands.": "Sprawdź, czy lubisz używać poleceń sudo.",
    "Check if you use WireGuard in Docker containers.": "Sprawdź, czy używasz WireGuard w kontenerach Docker.",
    "Click here to add a new config file": "Kliknij tutaj, aby dodać nowy plik konfiguracyjny",
    "Click here to add a new host": "Kliknij tutaj, aby dodać nowego hosta",
    "Click here to add a new translation": "Kliknij tutaj, aby dodać nowe tłumaczenie",
    "Config file": "Plik konfiguracyjny",
    "Example: host: Testhost (same as NAME on main page), Interface: wg0, config file: /etc/wireguard/wg0.conf": "Przykład: host: Testhost (taki sam jak NAZWA na stronie głównej), Interfejs: wg0, plik konfiguracyjny: /etc/wireguard/wg0.conf:",
    "Fully qualified path of the config file for this interface. Often: /etc/wireguard/wg0.conf": "W pełni kwalifikowana ścieżka pliku konfiguracyjnego dla tego interfejsu. Często: /etc/wireguard/wg0.conf",
    "Host": "Gospodarz",
    "Host address": "Adres hosta (IP)",
    "Host name": "Nazwa hosta",
    "Important": "Ważny",
    "Installation_hint_1": "Ten adapter obsługuje WireGuard zarówno w systemie Linux, jak i Windows.",
    "Installation_hint_2": "Komenda wg musi znajdować się w PATH, a użytkownik potrzebuje uprawnień administratora.",
    "Installation_hint_3": "Wskazówka: Aby uzyskać wskazówki dotyczące bezpieczeństwa dotyczące wykonującego użytkownika i sudo, zapoznaj się z plikiem ReadMe na github.",
    "Installation_hint_4": "Kliknij tutaj, aby przeczytać wskazówki dotyczące bezpieczeństwa na github.",
    "Installation_hint_5": "Zaznacz pole wyboru docker, jeśli używasz WireGuard wewnątrz kontenera docker; ",
    "Installation_hint_6": "sprawdź sudo, jeśli potrzebujesz sudo, aby wykonać polecenie bez hasła.",
    "Interface name": "Nazwa interfejsu",
    "Main config": "Konfiguracja główna",
    "Main settings": "Ustawienia główne",
    "May be an IP, DNS-Hostname or FQDN.": "Może być adresem IP, nazwą hosta DNS lub nazwą FQDN.",
    "Name": "Imię",
    "Name of your WireGuard Docker container.": "Nazwa Twojego kontenera WireGuard Docker.",
    "Name of your WireGuard interface. e.g. wg0": "Nazwa twojego interfejsu WireGuard. np. wg0",
    "Name of your WireGuard monitoring user.": "Nazwa użytkownika monitorowania WireGuard.",
    "Password": "Hasło",
    "Please add all public key to name translations here. This will make it more convenient for you to identify the peers in the object tree.": "Dodaj tutaj wszystkie klucze publiczne do tłumaczeń nazw. ",
    "Please add all your hosts running a WireGuard server instance which should be monitored.": "Dodaj wszystkie hosty z instancją serwera WireGuard, która powinna być",
    "Poll interval": "Interwał sondowania",
    "Pollinterval - in Seconds.": "Interwał sondowania - w sekundach.",
    "Public key": "Klucz publiczny",
    "Public key to username translations": "Klucz publiczny do tłumaczeń nazw użytkowników",
    "Public-Key translations": "Tłumaczenia klucza publicznego",
    "The Port your SSH server listens to.": "Port, na którym nasłuchuje Twój serwer SSH.",
    "Use sudo": "Użyj sudo",
    "User": "Użytkownik",
    "WireGuard Config files": "Pliki konfiguracyjne WireGuard",
    "WireGuard hosts": "Gospodarze WireGuard",
    "You need to list all your WireGuard config files here (with full path) to use the peer reactivation feature. For more information please see the readme file on github.": "Musisz wyświetlić tutaj listę wszystkich plików konfiguracyjnych WireGuard (z pełną ścieżką), aby użyć funkcji reaktywacji peera. ",
    "config file": "plik konfiguracyjny",
    "docker": "doker",
    "donation": "Jeśli podoba Ci się ten adapter i rozważ wsparcie mnie:",
    "sudo": "sudo",
    "wgConfigFile": "wg pliku konfiguracyjnego",
    "Name of the referenced host - must be the same as NAME on main config page!": "Nazwa wskazanego hosta - musi być taka sama jak NAME na głównej stronie konfiguracji!",
    "_Installation_hint_1": "Ten adapter obsługuje WireGuard zarówno w systemie Linux, jak i Windows."
}
