{
    "Check if you like to use sudo commands.": "Проверьте, хотите ли вы использовать команды sudo.",
    "Check if you use WireGuard in Docker containers.": "Проверьте, используете ли вы WireGuard в контейнерах Docker.",
    "Click here to add a new config file": "Нажмите здесь, чтобы добавить новый файл конфигурации",
    "Click here to add a new host": "Нажмите здесь, чтобы добавить новый хост",
    "Click here to add a new translation": "Нажмите здесь, чтобы добавить новый перевод",
    "Config file": "Файл конфигурации",
    "Example: host: Testhost (same as NAME on main page), Interface: wg0, config file: /etc/wireguard/wg0.conf": "Пример: хост: Testhost (то же, что и ИМЯ на главной странице), интерфейс: wg0, файл конфигурации: /etc/wireguard/wg0.conf\":",
    "Fully qualified path of the config file for this interface. Often: /etc/wireguard/wg0.conf": "Полный путь к файлу конфигурации для этого интерфейса. Часто: /etc/wireguard/wg0.conf",
    "Host": "Хозяин",
    "Host address": "Адрес хоста (IP)",
    "Host name": "Имя хоста",
    "Important": "Важный",
    "Installation_hint_1": "Этот адаптер поддерживает WireGuard как в Linux, так и в Windows.",
    "Installation_hint_2": "Команда wg должна быть в PATH, а пользователю нужны права администратора.",
    "Installation_hint_3": "Совет. Советы по безопасности относительно исполняющего пользователя и sudo см. в файле ReadMe на github.",
    "Installation_hint_4": "Нажмите здесь, чтобы прочитать советы по безопасности на github.",
    "Installation_hint_5": "Установите флажок Docker, если вы используете WireGuard внутри контейнера Docker; ",
    "Installation_hint_6": "проверьте sudo, если вам нужно sudo для выполнения команды без пароля.",
    "Interface name": "Имя интерфейса",
    "Main config": "Основная конфигурация",
    "Main settings": "Основные настройки",
    "May be an IP, DNS-Hostname or FQDN.": "Может быть IP, DNS-имя хоста или полное доменное имя.",
    "Name": "Имя",
    "Name of your WireGuard Docker container.": "Имя вашего контейнера WireGuard Docker.",
    "Name of your WireGuard interface. e.g. wg0": "Имя вашего интерфейса WireGuard. например WG0",
    "Name of your WireGuard monitoring user.": "Имя вашего пользователя мониторинга WireGuard.",
    "Password": "Пароль",
    "Please add all public key to name translations here. This will make it more convenient for you to identify the peers in the object tree.": "Пожалуйста, добавьте сюда все открытые ключи для перевода имен. ",
    "Please add all your hosts running a WireGuard server instance which should be monitored.": "Пожалуйста, добавьте все ваши хосты, на которых запущен экземпляр сервера WireGuard, который должен быть",
    "Poll interval": "Интервал опроса",
    "Pollinterval - in Seconds.": "Интервал опроса - в секундах.",
    "Public key": "Открытый ключ",
    "Public key to username translations": "Открытый ключ для перевода имени пользователя",
    "Public-Key translations": "Переводы с открытым ключом",
    "The Port your SSH server listens to.": "Порт, который слушает ваш SSH-сервер.",
    "Use sudo": "Используйте судо",
    "User": "Пользователь",
    "WireGuard Config files": "Файлы конфигурации WireGuard",
    "WireGuard hosts": "Хосты WireGuard",
    "You need to list all your WireGuard config files here (with full path) to use the peer reactivation feature. For more information please see the readme file on github.": "Вам нужно указать здесь все файлы конфигурации WireGuard (с полным путем), чтобы использовать функцию повторной активации одноранговых узлов. ",
    "config file": "файл конфигурации",
    "docker": "докер",
    "donation": "Если вам нравится этот адаптер и вы можете поддержать меня:",
    "sudo": "судо",
    "wgConfigFile": "конфигурационный файл wg",
    "Name of the referenced host - must be the same as NAME on main config page!": "Имя указанного хоста — должно совпадать с ИМЯ на главной странице конфигурации!",
    "_Installation_hint_1": "Этот адаптер поддерживает WireGuard как в Linux, так и в Windows."
}
