{
    "Check if you like to use sudo commands.": "Verifique se você gosta de usar comandos sudo.",
    "Check if you use WireGuard in Docker containers.": "Verifique se você usa o WireGuard em contêineres do Docker.",
    "Click here to add a new config file": "Clique aqui para adicionar um novo arquivo de configuração",
    "Click here to add a new host": "Clique aqui para adicionar um novo host",
    "Click here to add a new translation": "Clique aqui para adicionar uma nova tradução",
    "Config file": "Arquivo de configuração",
    "Example: host: Testhost (same as NAME on main page), Interface: wg0, config file: /etc/wireguard/wg0.conf": "Exemplo: host: Testhost (o mesmo que NAME na página principal), Interface: wg0, arquivo de configuração: /etc/wireguard/wg0.conf\":",
    "Fully qualified path of the config file for this interface. Often: /etc/wireguard/wg0.conf": "Caminho totalmente qualificado do arquivo de configuração para esta interface. Frequentemente: /etc/wireguard/wg0.conf",
    "Host": "Hospedeiro",
    "Host address": "Endereço do host (IP)",
    "Host name": "Nome de anfitrião",
    "Important": "Importante",
    "Installation_hint_1": "Este adaptador suporta WireGuard tanto no Linux quanto no Windows.",
    "Installation_hint_2": "O comando wg precisa estar no PATH e o usuário precisa de privilégios de administrador.",
    "Installation_hint_3": "Dica: Para dicas de segurança sobre o usuário em execução e o sudo, consulte o arquivo ReadMe no github.",
    "Installation_hint_4": "Clique aqui para ler dicas de segurança no github.",
    "Installation_hint_5": "Marque a caixa de seleção do docker se estiver executando o WireGuard dentro de um contêiner do docker; ",
    "Installation_hint_6": "verifique sudo se precisar de sudo para executar o comando sem senha.",
    "Interface name": "Nome da interface",
    "Main config": "Configuração principal",
    "Main settings": "Configurações principais",
    "May be an IP, DNS-Hostname or FQDN.": "Pode ser um IP, DNS-Hostname ou FQDN.",
    "Name": "Nome",
    "Name of your WireGuard Docker container.": "Nome do seu contêiner do Docker do WireGuard.",
    "Name of your WireGuard interface. e.g. wg0": "Nome da sua interface WireGuard. por exemplo. wg0",
    "Name of your WireGuard monitoring user.": "Nome do seu usuário de monitoramento do WireGuard.",
    "Password": "Senha",
    "Please add all public key to name translations here. This will make it more convenient for you to identify the peers in the object tree.": "Por favor, adicione todas as chaves públicas para traduções de nomes aqui. ",
    "Please add all your hosts running a WireGuard server instance which should be monitored.": "Por favor, adicione todos os seus hosts executando uma instância do servidor WireGuard que deve ser",
    "Poll interval": "Intervalo de sondagem",
    "Pollinterval - in Seconds.": "Pollinterval - em segundos.",
    "Public key": "Chave pública",
    "Public key to username translations": "Chave pública para traduções de nome de usuário",
    "Public-Key translations": "Traduções de chave pública",
    "The Port your SSH server listens to.": "A porta que seu servidor SSH escuta.",
    "Use sudo": "Usar sudo",
    "User": "Do utilizador",
    "WireGuard Config files": "Arquivos de configuração do WireGuard",
    "WireGuard hosts": "Anfitriões do WireGuard",
    "You need to list all your WireGuard config files here (with full path) to use the peer reactivation feature. For more information please see the readme file on github.": "Você precisa listar todos os seus arquivos de configuração do WireGuard aqui (com caminho completo) para usar o recurso de reativação de peer. ",
    "config file": "arquivo de configuração",
    "docker": "estivador",
    "donation": "Se você gosta deste adaptador e considera me apoiar:",
    "sudo": "sudo",
    "wgConfigFile": "arquivo de configuração wg",
    "Name of the referenced host - must be the same as NAME on main config page!": "Nome do host referenciado - deve ser o mesmo que NAME na página de configuração principal!"
}
