{
    "Check if you like to use sudo commands.": "Controlla se ti piace usare i comandi sudo.",
    "Check if you use WireGuard in Docker containers.": "Verifica se utilizzi WireGuard nei container Docker.",
    "Click here to add a new config file": "Fare clic qui per aggiungere un nuovo file di configurazione",
    "Click here to add a new host": "Fare clic qui per aggiungere un nuovo host",
    "Click here to add a new translation": "Clicca qui per aggiungere una nuova traduzione",
    "Config file": "File di configurazione",
    "Example: host: Testhost (same as NAME on main page), Interface: wg0, config file: /etc/wireguard/wg0.conf": "Esempio: host: Testhost (lo stesso di NAME nella pagina principale), Interfaccia: wg0, file di configurazione: /etc/wireguard/wg0.conf\":",
    "Fully qualified path of the config file for this interface. Often: /etc/wireguard/wg0.conf": "Percorso completo del file di configurazione per questa interfaccia. Spesso: /etc/wireguard/wg0.conf",
    "Host": "Ospite",
    "Host address": "Indirizzo dell'host (IP)",
    "Host name": "Nome host",
    "Important": "Importante",
    "Installation_hint_1": "Questo adattatore supporta WireGuard sia su Linux che su Windows.",
    "Installation_hint_2": "Il comando wg deve essere in PATH e l'utente necessita dei privilegi di amministratore.",
    "Installation_hint_3": "Suggerimento: per suggerimenti sulla sicurezza relativi all'utente in esecuzione e sudo, fare riferimento al file Leggimi su github.",
    "Installation_hint_4": "Fai clic qui per leggere i suggerimenti sulla sicurezza su github.",
    "Installation_hint_5": "Seleziona la casella di controllo della finestra mobile se stai eseguendo WireGuard all'interno di un contenitore della finestra mobile; ",
    "Installation_hint_6": "controlla sudo se hai bisogno di sudo per eseguire il comando senza password.",
    "Interface name": "Nome interfaccia",
    "Main config": "Configurazione principale",
    "Main settings": "Impostazioni principali",
    "May be an IP, DNS-Hostname or FQDN.": "Può essere un IP, un nome host DNS o un FQDN.",
    "Name": "Nome",
    "Name of your WireGuard Docker container.": "Nome del tuo container WireGuard Docker.",
    "Name of your WireGuard interface. e.g. wg0": "Nome della tua interfaccia WireGuard. per esempio. wg0",
    "Name of your WireGuard monitoring user.": "Nome del tuo utente di monitoraggio WireGuard.",
    "Password": "Parola d'ordine",
    "Please add all public key to name translations here. This will make it more convenient for you to identify the peers in the object tree.": "Aggiungi qui tutte le chiavi pubbliche per le traduzioni dei nomi. ",
    "Please add all your hosts running a WireGuard server instance which should be monitored.": "Aggiungi tutti i tuoi host che eseguono un'istanza del server WireGuard che dovrebbe essere",
    "Poll interval": "Intervallo di sondaggio",
    "Pollinterval - in Seconds.": "Intervallo di polling - in secondi.",
    "Public key": "Chiave pubblica",
    "Public key to username translations": "Chiave pubblica per le traduzioni del nome utente",
    "Public-Key translations": "Traduzioni a chiave pubblica",
    "The Port your SSH server listens to.": "La porta ascoltata dal tuo server SSH.",
    "Use sudo": "Usa sudo",
    "User": "Utente",
    "WireGuard Config files": "File di configurazione di WireGuard",
    "WireGuard hosts": "Host di WireGuard",
    "You need to list all your WireGuard config files here (with full path) to use the peer reactivation feature. For more information please see the readme file on github.": "È necessario elencare qui tutti i file di configurazione di WireGuard (con il percorso completo) per utilizzare la funzione di riattivazione peer. ",
    "config file": "file di configurazione",
    "docker": "portuale",
    "donation": "Se ti piace questo adattatore e considera di supportarmi:",
    "sudo": "sudo",
    "wgConfigFile": "file di configurazione wg",
    "Name of the referenced host - must be the same as NAME on main config page!": "Nome dell'host di riferimento - deve essere lo stesso di NAME nella pagina di configurazione principale!",
    "_Installation_hint_1": "Questo adattatore supporta WireGuard sia su Linux che su Windows."
}
