{
    "Click here to add a new config file": "Cliquez ici pour ajouter un nouveau fichier de configuration",
    "Click here to add a new host": "Cliquez ici pour ajouter un nouvel hôte",
    "Click here to add a new translation": "Cliquez ici pour ajouter une nouvelle traduction",
    "Example: host: Testhost (same as NAME on main page), Interface: wg0, config file: /etc/wireguard/wg0.conf": "Exemple : host : Testhost (identique à NAME sur la page principale), Interface : wg0, fichier de configuration : /etc/wireguard/wg0.conf\":",
    "Host address": "Adresse de l'hôte (IP)",
    "Host name": "Nom d'hôte",
    "Important": "Important",
    "Installation_hint_1": "Cet adaptateur prend en charge WireGuard aussi bien sur Linux que sur Windows.",
    "Installation_hint_2": "La commande wg doit être dans PATH et l'utilisateur a besoin de privilèges d'administrateur.",
    "Installation_hint_3": "Astuce : Pour des conseils de sécurité concernant l'utilisateur exécutant et sudo, veuillez vous référer au fichier Lisez-moi sur github.",
    "Installation_hint_4": "Cliquez ici pour lire les conseils de sécurité sur github.",
    "Installation_hint_5": "Cochez la case Docker si vous exécutez WireGuard dans un conteneur Docker ; ",
    "Installation_hint_6": "vérifiez sudo si vous avez besoin de sudo pour exécuter la commande sans mot de passe.",
    "Interface name": "Nom de l'interface",
    "Main settings": "Réglages principaux",
    "Name": "Nom",
    "Password": "Mot de passe",
    "Please add all public key to name translations here. This will make it more convenient for you to identify the peers in the object tree.": "Veuillez ajouter ici toutes les clés publiques pour nommer les traductions. ",
    "Please add all your hosts running a WireGuard server instance which should be monitored.": "Veuillez ajouter tous vos hôtes exécutant une instance de serveur WireGuard qui devrait être",
    "Poll interval": "Intervalle de sondage",
    "Public key": "Clé publique",
    "Public-Key translations": "Traductions de clé publique",
    "Use sudo": "Utiliser sudo",
    "User": "Utilisateur",
    "You need to list all your WireGuard config files here (with full path) to use the peer reactivation feature. For more information please see the readme file on github.": "Vous devez lister tous vos fichiers de configuration WireGuard ici (avec le chemin complet) pour utiliser la fonction de réactivation par les pairs. ",
    "config file": "fichier de configuration",
    "docker": "docker",
    "donation": "Si vous aimez cet adaptateur et envisagez de me soutenir :",
    "sudo": "sudo",
    "wgConfigFile": "fichier de configuration wg"
}